CommunityGD32Cores/gigadevice-firmware-and-docs/GD32W51x/GD32W51x_Addon_V1.0.0/GigaDevice.GD32W51x_DFP_1.0.0/GigaDevice.GD32W51x_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>GigaDevice</vendor>
  <url>http://gd32mcu.21ic.com/data/documents/yingyongruanjian/</url>
  <name>GD32W51x_DFP</name>
  <description>GigaDevice GD32W515 Series Device Support and Examples</description>
  <releases>
  <release version="1.0.0" date="2020-10-13">
    First Release version of GD32W515 Device Family Pack.
  </release>
  </releases>
  <keywords>
  <!-- keywords for indexing -->
  <keyword>GigaDevice</keyword>
  <keyword>Device Support</keyword>
  <keyword>GD32W515</keyword>
  </keywords>
  <devices>
    <family Dfamily="GD32W51x Series" Dvendor="GigaDevice:123">
      <processor Dcore="Cortex-M33"  Dmpu="1" Ddsp="DSP" Dfpu="1" Dendian="Little-endian" Dtz="TZ"/>
      <description>
GD32 is a new 32-bit high performance, low power consumption universal microcontroller family powered by the ARM Cortex-M33 RISC core,which targeted at various MCU application areas.
GD32 family integrates features to simplify system design and provide customers wide range of comprehensive and superior cost effective MCU portfolios with proven technology and great innovation.
GD32 family includes entry line, performance line and connectivity line currently.
      </description>
      <feature type="XTAL"               n="4000000"  m="32000000"  name="Crystal Oscillator"/>
      <feature type="CoreOther"       n="1"                                        name="CRC Calculation Unit"/>
      <feature type="DMA"               n="9"                                         name="General Purpose DMA with Centralized FIFO and Burst Support"/>
      <feature type="IntRC"              n="8000000"                           name="Internal 8M RC oscillator"/>
      <feature type="IntRC"              n="28000000"                           name="Internal 28M RC oscillator"/>      
      <feature type="RTC"                n="32000"                                 name="RTC with 32 kHz calibrated Oscillator and Battery Backup"/>
      <feature type="PLL"                 n="3"                                         name="Internal PLL"/>
      <feature type="PowerMode"    n="4"                                          name="Run, Sleep, Deep-Sleep, Standby"/>
      <feature type="PowerOther"    n="4"                                          name="POR, PDR, LVD, and BPOR"/>
      <feature type="ExtInt"             n="25"                                        name="External interrupt"/>            
      <feature type="Temp"             n="-40"          m="85"                name="Extended Operating Temperature Range"/>
      <feature type="ADC"               n="1"              m="18"                name="High-Performance ADC"/>
      <feature type="Timer"             n="1"              m="32"                name="32-bit General Purpose Timer"/>
      <feature type="Timer"             n="5"              m="16"                name="16-bit General Purpose Timer"/>
      <feature type="Timer"             n="1"              m="16"                name="Advanced Timer"/>
      <feature type="Timer"             n="2"              m="16"                name="Basic Timer"/>
      <feature type="Timer"             n="1"              m="24"                name="SysTick Timer"/>
      <feature type="WDT"               n="2"                                          name="Watchdog timer"/>
      <feature type="MPSerial"         n="4"                                          name="Multi-Purpose Serial Interface Module: I2C, I2S, SPI, USART"/> 
      <feature type="USART"            n="2"              m="12500000"    name="High-Speed USART Interface"/>
      <feature type="IOs"                 n="112"                                       name="IO pins"/>
      <feature type="I2C"                 n="3"                                           name="Low-Power I2C"/>
      <feature type="SPI"                  n="3"                                          name="SPI Interface"/>
      <feature type="I2S"                  n="2"                                          name="I2S Interface"  />
      <feature type="VCC"                n="1.8"                m="3.6"          name="Voltage"/>
  
<!-- ************************  Subfamily 'GD32W515'  **************************** -->
      <subFamily DsubFamily="GD32W515">
        <processor Dclock="180000000"/>
        <description>
        GD32W515 - ARM Cortex-M33 Core
          Frequency up to 180 MHz
          Single-cycle multiplier and hardware divider

        Memories
          It provides up to 1024KB or 2048 KB embedded Flash memory or up to 32MB of EXT Flash memory
          SRAM size from 384 KB to 448KB with HW parity checking
        </description>
        <!-- *************************  Device 'GD32W515PIQ6'  ***************************** -->
        <device Dname="GD32W515PIQ6">
          <memory    id="IROM1"                   start="0x08000000" size="0x0200000" startup="1" default="1"/>
          <memory    id="IROM2"                   start="0x0C000000" size="0x0200000" startup="1" default="0"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x70000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x30000000" size="0x70000" init   ="0" default="0"/>
          <algorithm name="Flash/GD3W515_NS.FLM"   start="0x08000000" size="0x02000" default="1"/>
          <algorithm name="Flash/GD3W515_S.FLM"   start="0x0C000000" size="0x02000" default="1"/>
          <compile header="Device/Include/gd32w51x.h"/>
          <debug svd="SVD/GD32W515Px.svd"/>
        </device>
        <!-- *************************  Device 'GD32W515P0Q6'  ***************************** -->
        <device Dname="GD32W515P0Q6">
          <memory    id="IROM1"                   start="0x08000000" size="0x0200000" startup="1" default="1"/>
          <memory    id="IROM2"                   start="0x0C000000" size="0x0200000" startup="1" default="0"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x70000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x30000000" size="0x70000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32W515_Ext_2M.FLM"   start="0x08000000" size="0x02000" default="1"/>
          <algorithm name="Flash/GD32W515_Ext_2M.FLM"   start="0x0C000000" size="0x02000" default="1"/>
          <compile header="Device/Include/gd32w51x.h"/>
          <debug svd="SVD/GD32W515Px.svd"/>
        </device>
        <!-- *************************  Device 'GD32W515TIQ6'  ***************************** -->
        <device Dname="GD32W515TIQ6">
          <memory    id="IROM1"                   start="0x08000000" size="0x0200000" startup="1" default="1"/>
          <memory    id="IROM2"                   start="0x0C000000" size="0x0200000" startup="1" default="0"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x70000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x30000000" size="0x70000" init   ="0" default="0"/>
          <algorithm name="Flash/GD3W515_NS.FLM"   start="0x08000000" size="0x02000" default="1"/>
          <algorithm name="Flash/GD3W515_S.FLM"   start="0x0C000000" size="0x02000" default="1"/>
          <compile header="Device/Include/gd32w51x.h"/>
          <debug svd="SVD/GD32W515Tx.svd"/>
        </device>
        <!-- *************************  Device 'GD32W515TGQ6'  ***************************** -->
        <device Dname="GD32W515TGQ6">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IROM2"                   start="0x0C000000" size="0x0100000" startup="1" default="0"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x60000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x30000000" size="0x60000" init   ="0" default="0"/>
          <algorithm name="Flash/GD3W515_NS.FLM"   start="0x08000000" size="0x02000" default="1"/>
          <algorithm name="Flash/GD3W515_S.FLM"   start="0x0C000000" size="0x02000" default="1"/>
          <compile header="Device/Include/gd32w51x.h"/>
          <debug svd="SVD/GD32W515Tx.svd"/>
        </device>
      </subFamily>
    
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Security Conditions -->
    <condition id="isSecure">
      <description>TZ enabled secure app</description>
      <require Dsecure="Secure"/>
    </condition>
    <condition id="isNonSecure">
      <description>TZ enabled non-secure app </description>
      <require Dsecure="Non-secure"/>
    </condition>
    <condition id="noTZ">
      <description>Not TZ enabled app</description>
      <require Dsecure="TZ-disabled"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="GD32W515">
      <description>GigaDevice GD32W515 Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32W515*[I]*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

