CommunityGD32Cores/gigadevice-firmware-and-docs/GD32W51x/GD32W51x_Addon_V1.0.0/GigaDevice.GD32W51x_DFP_1.0.0/GigaDevice.GD32W51x_DFP.pdsc
    <condition id="GD32W515_S">
      <description>GigaDevice GD32W515 Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32W515*[I]*"/>
      <require Cclass="Device" Cgroup="Startup" />
      <require Dsecure="Secure"/>
    </condition>

   <!-- Device + CMSIS Conditions -->
    <condition id="GD32W515 CMSIS">
      <description>GigaDevice GD32W515 Devices and CMSIS-CORE</description>
     <accept condition="GD32W515"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="gd32w51x_libopt"/>    
      <require Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="RCU"/>           
      <require Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="PMU"/>    
    </condition>

    <!-- Device + Compiler Conditions (ARMCC) -->
    <condition id="GD32W515 ARMCC" >
      <description>GigaDevice GD32W515 Devices and ARMCC Compiler</description>
      <require condition="GD32W515"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <!-- Device + Security + Compiler Conditions (ARMCC) -->
    <condition id="GD32W515 noTZ ARMCC" >
      <require Dvendor="GigaDevice:123" Dname="GD32W515*[0][I][G]*"/>
      <require condition="noTZ"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="GD32W515 isSecure ARMCC" >
      <require Dvendor="GigaDevice:123" Dname="GD32W515*[0][I][G]**"/>
      <require condition="isSecure"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="GD32W515 isNonSecure ARMCC" >
      <require Dvendor="GigaDevice:123" Dname="GD32W515*[0][I][G]*"/>
      <require condition="isNonSecure"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <!-- GD32W515 STDPERIPHERALS RCU Conditions -->
    <condition id="GD32W515 STDPERIPHERALS RCU">
      <description>GigaDevice GD32W515 Standard Peripherals Drivers with RCU</description>
      <require condition="GD32W515 CMSIS"/>
      <require Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="RCU"/>
    </condition>

     <!-- GD32W515 STDPERIPHERALS MISC Conditions -->
    <condition id="GD32W515 STDPERIPHERALS MISC">
      <description>GigaDevice GD32W515 Standard Peripherals Drivers with MISC</description>
      <require condition="GD32W515 CMSIS"/>
      <require Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="MISC"/>
    </condition>

     <!-- GD32W515 STDPERIPHERALS EVAL Conditions -->
    <condition id="GD32W515 STDPERIPHERALS EVAL">
      <description>GigaDevice GD32W515 Standard Peripherals Drivers with EVAL</description>
      <require condition="GD32W515 CMSIS"/>
      <require Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="EXTI"/>
      <require Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="USART"/>
    </condition> 
 
  </conditions>

  <components>
    <!-- GD32W515_StdPeripherals -->
    <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="ADC" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Analog-to-digital converter (ADC) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
        </RTE_Components_h>
        <files>
          <!-- ADC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_adc.h"/>
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_adc.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="ICACHE" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Instruction cache (ICACHE) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ICACHE
        </RTE_Components_h>
        <files>
          <!-- BKP flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_icache.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_icache.c" attr="config" version="1.0.0" />
        </files>
    </component>
	
   <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="HPDF" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>High-Performance Digital Filter (HPDF) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_HPDF
        </RTE_Components_h>
        <files>
          <!-- HPDF flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_hpdf.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_hpdf.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="CRC" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Cyclic Redundancy Check (CRC) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
        </RTE_Components_h>
        <files>
          <!-- CRC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_crc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_crc.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="TZPCU" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>TrustZone global protection controller (TZPCU) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TZPCU
        </RTE_Components_h>
        <files>
          <!-- DAC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_tzpcu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_tzpcu.c" attr="config" version="1.0.0" />
        </files>
    </component>
	
   <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="DBG" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Debug (DBG) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DBG
        </RTE_Components_h>
        <files>
          <!-- DBG flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_dbg.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_dbg.c" attr="config" version="1.0.0" />
        </files>
  </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="DMA" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Direct Memory Access (DMA) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
        </RTE_Components_h>
        <files>
          <!-- DMA flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_dma.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_dma.c" attr="config" version="1.0.0" />
        </files>
    </component>

