CommunityGD32Cores/gigadevice-firmware-and-docs/GD32W51x/GD32W51x_Addon_V1.0.0/GigaDevice.GD32W51x_DFP_1.0.0/GigaDevice.GD32W51x_DFP.pdsc
  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="TRNG" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>True random number generator(TRNG) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ENET
        </RTE_Components_h>
        <files>
          <!-- ENET flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_trng.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_trng.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="EFUSE" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>EFUSE driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EFUSE
        </RTE_Components_h>
        <files>
          <!-- EFUSE flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_efuse.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_efuse.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="EXTI" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>External Interrupt/Event (EXTI) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXTI
        </RTE_Components_h>
        <files>
          <!-- EXTI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_exti.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_exti.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="FMC" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Flash Memory Controller (FMC) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FMC
        </RTE_Components_h>
        <files>
          <!-- FMC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_fmc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_fmc.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="FWDGT" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Free watchdog timer(FWDGT) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FWDGT
        </RTE_Components_h>
        <files>
          <!-- FWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_fwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_fwdgt.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="GPIO" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
        <files>
          <!-- GPIO flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_gpio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_gpio.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="I2C" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Inter-integrated Circuit (I2C) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
        <files>
          <!-- I2C flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_i2c.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_i2c.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="MISC" Cversion="1.0.0" condition="GD32W515 CMSIS">
      <description>MISC driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
        </RTE_Components_h>
        <files>
          <!-- MISC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_misc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_misc.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="PMU" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Power Managment Unit(PMU) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PMU
        </RTE_Components_h>
        <files>
          <!-- PMU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_pmu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_pmu.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="RCU" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS MISC">
      <description>Reset and Clock Control (RCU) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RCU
        </RTE_Components_h>
        <files>
          <!-- RCU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_rcu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_rcu.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="RTC" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Real-time Clock (RTC) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RTC
        </RTE_Components_h>
        <files>
          <!-- RTC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_rtc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_rtc.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="SDIO" Cversion="1.0.0" condition="GD32W515 CMSIS">
      <description>Secure digital input/output interface(SDIO) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SDIO
        </RTE_Components_h>
        <files>
          <!-- SDIO flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_sdio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_sdio.c" attr="config" version="1.0.0" />
        </files>
    </component>

