CommunityGD32Cores/gigadevice-firmware-and-docs/GD32W51x/GD32W51x_Addon_V1.0.0/GigaDevice.GD32W51x_DFP_1.0.0/GigaDevice.GD32W51x_DFP.pdsc
  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="SPI_I2S" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI_I2S) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
        </RTE_Components_h>
        <files>
          <!-- SPI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_spi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_spi.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="SQPI" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Serial Qual Paralle Interface (SQPI) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SQPI
        </RTE_Components_h>
        <files>
          <!-- SQPI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_sqpi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_sqpi.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="QSPI" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Quad-SPI interface (QSPI) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_QSPI
        </RTE_Components_h>
        <files>
          <!-- SQPI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_qspi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_qspi.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="TIMER" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>TIMER driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TIMER
        </RTE_Components_h>
        <files>
          <!-- TIMER flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_timer.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_timer.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="TSI" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Touch sensing interface (TSI) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TSI
        </RTE_Components_h>
        <files>
          <!-- TMU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_tsi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_tsi.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="DCI" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Digital camera interface (DCI) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DCI
        </RTE_Components_h>
        <files>
          <!-- TMU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_dci.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_dci.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="CAU" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Cryptographic Acceleration Unit (CAU) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAU
        </RTE_Components_h>
        <files>
          <!-- TMU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_cau.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_cau.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="HAU" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Hash Acceleration Unit (HAU) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAU
        </RTE_Components_h>
        <files>
          <!-- HAU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_hau.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_hau.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="PKCAU" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Public Key Cryptographic Acceleration Unit (PKCAU) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PKCAU
        </RTE_Components_h>
        <files>
          <!-- PKCAU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_pkcau.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_pkcau.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="USART" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
        <files>
          <!-- USART flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_usart.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_usart.c" attr="config" version="1.0.0" />
        </files>
    </component>

