CommunityGD32Cores/gigadevice-firmware-and-docs/GD32W51x/GD32W51x_Addon_V1.0.0/GigaDevice.GD32W51x_DFP_1.0.0/GigaDevice.GD32W51x_DFP.pdsc
  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="WWDGT" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>Window Watchdog Timer (WWDGT) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDGT
        </RTE_Components_h>
        <files>
          <!-- WWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_wwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_wwdgt.c" attr="config" version="1.0.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32W515_StdPeripherals" Csub="SYSCFG" Cversion="1.0.0" condition="GD32W515 STDPERIPHERALS RCU">
      <description>System configuration controller  (SYSCFG) driver for GD32W515 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SYSCFG
        </RTE_Components_h>
        <files>
          <!-- WWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32w51x_syscfg.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32w51x_syscfg.c" attr="config" version="1.0.0" />
        </files>
    </component>

   <!-- Startup GD32W515 -->
    <component Cclass="Device" Cgroup="Startup"  Cversion="1.0.0" condition="GD32W515">
      <description>System Startup for GigaDevice GD32W515  Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32w51x.h"/>
        <file category="header" name="Device/Include/ARMCM33_TZ.h"/>

        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32w51x.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>

        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32w51x.c" attr="config" version="1.0.0"/>
       <!-- SAU configuration -->                                                                                                                                            
        <file category="header" condition="GD32W515_S"                         name="Device/Template/partition_gd32w51x.h"            attr="config" version="1.0.0"/>

      </files>
    </component>
  </components>
</package>
